cd "D:\QOMASH\site working\site 3 open code"
git add .
git commit -m "Update latest project changes"
git push origin main

قسم جرد داخل المخازن لعمل جرد وتقارير للجرد مع سعر شراءها وسعر بيعها وتفاصيبل  جرد كاملة وامكانية عمل جرد لبند واحد  او لبنود متعددة او كل البنود 
اريد قسم جرد كامل احترافي داخل قسم المخازن
اريد نظام حضور وانصراف من خلال تسجيل الدخول والخروج وامكانية التحكم في الاوقات التي يتم فيها تسجيل الدخول والخروج لضبط اوقات معينة للدخول واوقات معينة للخروج 
اريدها قسم منفصل احترافي يحسب الوقت بين الدخول والخروج ويسجل الوقت بينهم على ان الموظف داخل العمل وهكذا؟

اريد عند تسجيل دفعة للموردين يكون في خيار الزامي يخيرني بين خصمه من حساب الماكينة ام من الحساب البنكي او اخر لا يخصم من الماكينة او البنك
ويسجل في القسم الذي تم الخصم منه ويخصم هل فهمت


في قسم الزبائن اذا كتبت الرقم في البحث واذا لرقم متشابه يظهر المتشابهين فورا على حسب البحث لا ينتظهر حتى اكتب كل الرقم 

اذا عملت تصدير لملف اكسيل يظهر لي {"detail":"لم يتم تزويد بيانات الدخول."}
ولا يفتح الاكسيل 
واريد كل ملفات الاكسيل التي تصدر في المشروع تصدر بطريقة مرتبة واحترافية ومنسقة حتى تكون واضحة وسهلة 

اريد توزيع المبيعات ع الموظفين يظهر ايضا عدد القطع المباعة لكل موظف 


عند تسجيل مصروف اريد يظهر في الصف خانة الملاحظات

واريد نقل زر  تصنيفات المصاريف من الثيمات والتحكم الى قسم المصاريف 

اكتب اخر ظهور الوقت واذا اكثر من يوم اكتب اليوم والتاريخ تحت كل اسم شخص في قسم التواصل 

اريد في قسم الزبائن زر الكل ومهمته يظهر كل الزبائن بدون تاريخ محدد واريد امكانية اذا كتبت رقم خطا يقولي ان هذا العميل غير مسجل
