cd "D:\QOMASH\site working\site 3 open code"
git add .
git commit -m "Update latest project changes"
git push origin main

قسم جرد داخل المخازن لعمل جرد وتقارير للجرد مع سعر شراءها وسعر بيعها وتفاصيبل  جرد كاملة وامكانية عمل جرد لبند واحد  او لبنود متعددة او كل البنود 
اريد قسم جرد كامل احترافي داخل قسم المخازن
اريد نظام حضور وانصراف من خلال تسجيل الدخول والخروج وامكانية التحكم في الاوقات التي يتم فيها تسجيل الدخول والخروج لضبط اوقات معينة للدخول واوقات معينة للخروج 
اريدها قسم منفصل احترافي يحسب الوقت بين الدخول والخروج ويسجل الوقت بينهم على ان الموظف داخل العمل وهكذا؟

